/* empty css                */
import { c as createComponent } from './astro-component_DfenplIq.mjs';
import 'piccolore';
import { m as maybeRenderHead, u as unescapeHTML, b as renderTemplate } from './entrypoint_C9AHn4Vx.mjs';
import 'clsx';

const html = () => "<p>喜欢是需要理由的，但直到我们意识到这个理由需要存在之前，我们都可以继续喜欢下去——我们是否可以毫无理由地处于幸福中？</p>\n<p>“那么你有什么特长呢？”，修行即将结束的魔女这样问琪琪</p>\n<p>“除了飞行，我什么都不会”，琪琪这样说</p>\n<p>“真傲慢，还有那只猫，也令人讨厌”，琪琪的黑猫吉吉伸出舌头，“噗～”</p>\n<p>飞行是一件伴随着铃铛响声、收音机的歌声还有天气预报的事情，琪琪虽然飞得不好，但她已经迫不及待地向往着飞向某个地方了——带着妈妈给的扫帚——直到她来到了能看得到海的街道：</p>\n<p>“哎！你的东西忘拿了！”，面包店的索娜姐这样对着推着婴儿车走远的人喊道</p>\n<p>“我或许能帮你送过去”，琪琪跨上扫帚飞到空中，为索娜姐带回了一封感谢信</p>\n<p>这之后，刻着使命必达的宅急便牌子挂到了面包房的橱窗上，克拉克城的高空多出了一个穿着黑色衣服，总是带着一只黑猫的魔女。</p>\n<p>“请你在这里签收”，琪琪总是这样说。</p>\n<p>有一天，名叫蜻蜓的男孩带着琪琪骑着用螺旋桨驱动的自行车，带她来到了即将试航的飞艇面前：螺旋桨呼呼地转着，琪琪觉得好刺激，大家就算没有魔法也拥有飞翔的力量。</p>\n<p>那琪琪有什么特长呢？</p>\n<p>“除了飞行，我什么都不会”，琪琪这样想。吉吉只是看着她，什么也没说</p>\n<p>当存在异化为功能，当幸福被衡量，当我们不得不为喜欢找到一个普世化的价值——以支持它们的合法性。因此我们首先将幸福变现为理由，将劳动变现为物质。直到在不远的一天，我们不得不发现：奇迹与魔法并不独属于自己，而是普惠的、世俗的、大众的——直至这种本真性的丧失。</p>\n<p>琪琪突然不会飞了：她握着扫帚，但熟悉的风并未出现。住在森林中的画家乌露丝拉告诉她，不妨停下来试试，直到遇到某件事情将灵感一下子激发出来，就像她遇到琪琪那时一样——将无意识的激情重新调动起来——将心回归原始吧。</p>\n<p>“快看！”，试航那天，阿美指着电视，“飞艇要被吹走了！”</p>\n<p>“飞艇快要被大风刮倒天上去了！只剩下一根固定的绳子了！大家能否拽住它呢！”，转播员这样说。琪琪在那位会做鲱鱼南瓜派的老妇人家中的电视上看到蜻蜓被吹上了天，他只能抓住那根绳子好让自己不掉下去。</p>\n<p>“抱歉！这个可以借用一下吗！”，琪琪拿过清洁工大叔手里的地板刷，使劲让自己周围出现一股风——正如她第一次起飞那样——腾空而起。当象征物被功能物替代后，琪琪便摆脱了对无意识激情的依赖——它是多么的不可靠啊——尽管代价是琪琪的心再也无法回归原始了，但她已经能稳稳拉住掉落的蜻蜓，一起迎接众人的掌声。</p>\n<p>我们曾追问：是否可以毫无理由地处于幸福中？我们当然可以毫无理由地继续下去，可是当我们的情绪本身变为彻底祛魅的符号，当无意识的激情变为完全的工具理性，我们便再也无法假装不知道：喜欢，是需要理由的——有知的增加，即痛苦的增加。</p>\n<p>吉吉已经不需要再对琪琪说什么了：琪琪已经能够自己找到下一个、能看得到海的街道了。</p>";

				const frontmatter = {"title":"魔女的宅急便——去往能看得到海的街道","date":"2026-4-9 01:14:00 +0800","minutesRead":"6 min","words":1038};
				const file = "/Users/mokiia1107/Documents/GitHub/Mokiia-website/src/pages/blog/blog5.md";
				const url = "/blog/blog5";
				function rawContent() {
					return "   \n                         \n                             \n   \n喜欢是需要理由的，但直到我们意识到这个理由需要存在之前，我们都可以继续喜欢下去——我们是否可以毫无理由地处于幸福中？\n\n“那么你有什么特长呢？”，修行即将结束的魔女这样问琪琪\n\n“除了飞行，我什么都不会”，琪琪这样说\n\n“真傲慢，还有那只猫，也令人讨厌”，琪琪的黑猫吉吉伸出舌头，“噗～”\n\n飞行是一件伴随着铃铛响声、收音机的歌声还有天气预报的事情，琪琪虽然飞得不好，但她已经迫不及待地向往着飞向某个地方了——带着妈妈给的扫帚——直到她来到了能看得到海的街道：\n\n“哎！你的东西忘拿了！”，面包店的索娜姐这样对着推着婴儿车走远的人喊道\n\n“我或许能帮你送过去”，琪琪跨上扫帚飞到空中，为索娜姐带回了一封感谢信\n\n这之后，刻着使命必达的宅急便牌子挂到了面包房的橱窗上，克拉克城的高空多出了一个穿着黑色衣服，总是带着一只黑猫的魔女。\n\n“请你在这里签收”，琪琪总是这样说。\n\n有一天，名叫蜻蜓的男孩带着琪琪骑着用螺旋桨驱动的自行车，带她来到了即将试航的飞艇面前：螺旋桨呼呼地转着，琪琪觉得好刺激，大家就算没有魔法也拥有飞翔的力量。\n\n那琪琪有什么特长呢？\n\n“除了飞行，我什么都不会”，琪琪这样想。吉吉只是看着她，什么也没说\n\n当存在异化为功能，当幸福被衡量，当我们不得不为喜欢找到一个普世化的价值——以支持它们的合法性。因此我们首先将幸福变现为理由，将劳动变现为物质。直到在不远的一天，我们不得不发现：奇迹与魔法并不独属于自己，而是普惠的、世俗的、大众的——直至这种本真性的丧失。\n\n琪琪突然不会飞了：她握着扫帚，但熟悉的风并未出现。住在森林中的画家乌露丝拉告诉她，不妨停下来试试，直到遇到某件事情将灵感一下子激发出来，就像她遇到琪琪那时一样——将无意识的激情重新调动起来——将心回归原始吧。\n\n“快看！”，试航那天，阿美指着电视，“飞艇要被吹走了！”\n\n“飞艇快要被大风刮倒天上去了！只剩下一根固定的绳子了！大家能否拽住它呢！”，转播员这样说。琪琪在那位会做鲱鱼南瓜派的老妇人家中的电视上看到蜻蜓被吹上了天，他只能抓住那根绳子好让自己不掉下去。\n\n“抱歉！这个可以借用一下吗！”，琪琪拿过清洁工大叔手里的地板刷，使劲让自己周围出现一股风——正如她第一次起飞那样——腾空而起。当象征物被功能物替代后，琪琪便摆脱了对无意识激情的依赖——它是多么的不可靠啊——尽管代价是琪琪的心再也无法回归原始了，但她已经能稳稳拉住掉落的蜻蜓，一起迎接众人的掌声。\n\n我们曾追问：是否可以毫无理由地处于幸福中？我们当然可以毫无理由地继续下去，可是当我们的情绪本身变为彻底祛魅的符号，当无意识的激情变为完全的工具理性，我们便再也无法假装不知道：喜欢，是需要理由的——有知的增加，即痛苦的增加。\n\n吉吉已经不需要再对琪琪说什么了：琪琪已经能够自己找到下一个、能看得到海的街道了。";
				}
				async function compiledContent() {
					return await html();
				}
				function getHeadings() {
					return [];
				}

				const Content = createComponent((result, _props, slots) => {
					const { layout, ...content } = frontmatter;
					content.file = file;
					content.url = url;

					return renderTemplate`<meta charset="utf-8">${maybeRenderHead()}${unescapeHTML(html())}`;
				});

const _page = /*#__PURE__*/Object.freeze(/*#__PURE__*/Object.defineProperty({
	__proto__: null,
	Content,
	compiledContent,
	default: Content,
	file,
	frontmatter,
	getHeadings,
	rawContent,
	url
}, Symbol.toStringTag, { value: 'Module' }));

const page = () => _page;

export { page };
